Revit 2024 API
BuiltInFailures.RebarFailures.CannotSolveRebarShapeUsingDataFromDimension Property
 Cannot solve rebar shape using the current constraints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotSolveRebarShapeUsingDataFromDimension { get; }
Visual Basic
Public Shared ReadOnly Property CannotSolveRebarShapeUsingDataFromDimension As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotSolveRebarShapeUsingDataFromDimension {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace